JacksonOvO/Software_VX_4208/Drivers/src/STM32F0IAPDriver.c
/******************************************************************
*
*文件名称:  STM32F0IAPDriver.c
*文件标识:
*内容摘要:
*其它说明:
*当前版本:
*
*修改记录1:
*    修改日期:
*    版 本 号:
*    修 改 人:
*    修改内容:
******************************************************************/


/******************************************************************
*                             头文件                              *
******************************************************************/
#include "STM32F0IAPDriveropt.h"
#include "STM32F0IAPDriver.h"
#include "STM32F0usartopt.h"


/******************************************************************
*                           数据类型                              *
******************************************************************/
/* 看门狗宏定义 */
/* watchdog宏定义 */

#if (IAP_IO_CODE_TYPE == IAP_FR4004_CODE) ||(IAP_IO_CODE_TYPE == IAP_FR4014_CODE)||(IAP_IO_CODE_TYPE == IAP_FR4024_CODE)||(IAP_IO_CODE_TYPE == IAP_FR4504_CODE)||(IAP_IO_CODE_TYPE == IAP_FR4514_CODE)||(IAP_IO_CODE_TYPE == IAP_FR4524_CODE)||(IAP_IO_CODE_TYPE == IAP_FR4124_CODE)||(IAP_IO_CODE_TYPE == IAP_FR4114_CODE)||(IAP_IO_CODE_TYPE == IAP_FR4104_CODE)
#define IAP_WATCH_DOG_GPIO  (IAP_GPIOA)
#define IAP_WATCH_DOG_PIN   (IAP_GPIO_Pin_2)
#endif
/* 看门狗宏定义 */

/* CRC */
#define IAP_CRC16_USETABLE          ( 0 )


/******************************************************************
*                           全局变量声明                          *
******************************************************************/ 
/*接收DMA BUFFER*/
IAP_uint8_t gucIAPUpgradeRebuffer[RECEIVE_SIZE]@0x20000000;

/*定义DMA发送缓存*/
IAP_uint8_t gucIAPUpgradeTxbuffer[RECEIVE_SIZE]@0x20000100;
IAP_uint16_t gusIAPUpgradeTxbuffer[RECEIVE_SIZE]@0x20000200;

/* 静态变量固化 */
IAP_uint32_t ucIAPWatchdogCount@0x20000400;
IAP_uint32_t uiNextCodePackageSN@0x20000404;
IAP_uint32_t uiNextDeviceInfoPackageSN@0x20000408;
IAP_uint32_t uiNextVersionPackageSN@0x2000040c;


/* 数组固化 */
__root const IAP_uint8_t IAPAPBAHBPrescTable[MESSGAE_SIZE]@".IAPAPBAHBPrescTable" = 
{0, 0, 0, 0, 1, 2, 3, 4, 1, 2, 3, 4, 6, 7, 8, 9};
extern IAP_uint16_t gusUSART1DMATx[DMA_SEND_BUFSIZE];

/******************************************************************
*                        局部函数声明                            *
******************************************************************/
static IAPUSHORT usIapUtlCRC16GetTab( IAPUBYTE ubIdx );
static IAPUSHORT usIapMBSCRC16( const IAPUBYTE *pucFrame, IAPUSHORT usLen );
static void IAP_GPIO_SetBits(IAP_GPIO_TypeDef* GPIOx, IAP_uint16_t GPIO_Pin);
static void IAP_GPIO_ResetBits(IAP_GPIO_TypeDef* GPIOx, IAP_uint16_t GPIO_Pin);
static void IAPFeedTheWatchDog(void);
static void STM32F0IAPReceive(IAP_uint32_t uiReceiveLength);
static void STM32F0IAPSend(IAP_uint8_t *pucSendBuffer, IAP_uint16_t usSendLength);
static void IAP_FLASH_Unlock(void);
static IAP_FLASH_Status IAP_FLASH_GetStatus(void);
static IAP_FLASH_Status IAP_FLASH_WaitForLastOperation(IAP_uint32_t Timeout);
static IAP_FLASH_Status IAP_FLASH_ErasePage(IAP_uint32_t Page_Address);
static IAP_FLASH_Status IAP_FLASH_ProgramWord(IAP_uint32_t Address, IAP_uint32_t Data);
static void STM32F0IAPMemset(IAP_uint8_t ucBuffer[RECEIVE_SIZE], IAP_uint16_t uiLength);
static void STM32F0IAPMemcpy(IAP_uint8_t *pucDst, IAP_uint8_t *pucSrc, IAP_uint32_t uiLength);
static void STM32FOIAPTypeIndicate(IAP_uint8_t ucFrameType, IAP_uint8_t ucSlaveStationNumber);
static void STM32F0TypeIndicateResponse(IAP_uint8_t ucSlaveStationNum,
                IAP_uint8_t ucFrameType, IAP_uint8_t ucUpgradeType, IAP_uint8_t ucHandleResult);
static void STM32FOIAPContent(void);
static void STM32F0ContentIndicateResponse(IAP_uint8_t *pucReceiveBuff, IAP_uint8_t ucHandleResult);
static IAP_Result_e STM32F0IAPRAMToFlash(IAP_uint8_t *pucReceiveBuff, IAP_uint8_t ucPacketretransmission, 
            IAP_uint32_t uiUpgradePackageSN, IAP_uint16_t usUpgradePackagelen, IAP_uint32_t uiNextPackageSN, IAP_uint32_t uiFlashDestination);
static IAP_Result_e STM32IAPContentFrameCheck(IAP_uint8_t *pucReceiveBuff, IAP_uint32_t uiUpgradePackageSN, 
                                           IAP_uint8_t ucPacketretransmission, IAP_uint16_t usUpgradePackagelen, IAP_uint32_t uiNextPackageSN);
static void STM32FOIAPComplete(IAP_uint8_t ucFrameType, IAP_uint8_t ucSlaveStationNumber);
static void STM32F0Reset(void);
static void STM32F0IAPCompleteIndicateResponse(IAP_uint8_t ucSlaveStationNum, IAP_uint8_t ucFrameType,IAP_uint8_t ucHandleResult);

/******************************************************************
*函数名称:usIapMBSCRC16
*功能描述:CRC校验
*输入参数:pucFrame       BUFFER指针
                            usLen             长度
*输出参数:
*返回值:
*其它说明:添加CRC校验，以确保传输数据正确
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/2/27                              zhanghaifeng  we015
******************************************************************/

#if IAP_CRC16_USETABLE == 0
static         IAPUSHORT
usIapUtlCRC16GetTab( IAPUBYTE ubIdx )
{
    IAPUSHORT          usCRC16;
    IAPUSHORT          usC;
    IAPUBYTE           i;

    usCRC16 = 0;
    usC = ( IAPUSHORT ) ubIdx;

    for( i = 0; i < 8; i++ )
    {

        if( ( usCRC16 ^ usC ) & 0x0001 )
        {
            usCRC16 = ( usCRC16 >> 1 ) ^ ( IAPUSHORT )0xA001U;
        }
        else
        {
            usCRC16 = usCRC16 >> 1;
        }
        usC = usC >> 1;
    }
    return usCRC16;
}
#endif

static IAPUSHORT
usIapMBSCRC16( const IAPUBYTE *pucFrame, IAPUSHORT usLen )
{
    IAPUBYTE           ubCRCHi = 0xFF;
    IAPUBYTE           ubCRCLo = 0xFF;
    IAPUBYTE           ubIndex;

#if IAP_CRC16_USETABLE == 0
    IAPUSHORT          usCRCTableValue;
#endif

    while( usLen-- )
    {
        ubIndex = ubCRCLo ^ *( pucFrame++ );
#if IAP_CRC16_USETABLE == 1
        ubCRCLo = ubCRCHi ^ ( IAPUBYTE ) IapaucCRCHi[ubIndex];
        ubCRCHi = ( IAPUBYTE ) IapaucCRCLo[ubIndex];
#else
        usCRCTableValue = usIapUtlCRC16GetTab( ubIndex );
        ubCRCLo = ubCRCHi ^ ( IAPUBYTE ) ( usCRCTableValue & 0xFF );
        ubCRCHi = ( IAPUBYTE ) ( usCRCTableValue >> 8U );
#endif

