JacksonOvO/Software_VX_4208/Drivers/src/STM32F0IAPDriver.c
    }
    /* Additional casts a for PIC MCC18 compiler to fix a bug when -Oi is not used. 
     * This is required because it does not enforce ANSI c integer promotion
     * rules.
     */
    return ( IAPUSHORT )( ( IAPUSHORT )ubCRCHi << 8 | ( IAPUSHORT)ubCRCLo );
}

/******************************************************************
*函数名称:IAP_GPIO_SetBits
*功能描述:
*输入参数:
*输出参数:
*返回值:
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/3/7                              lv we004
******************************************************************/
static void IAP_GPIO_SetBits(IAP_GPIO_TypeDef* GPIOx, IAP_uint16_t GPIO_Pin)
{
  GPIOx->BSRR = GPIO_Pin;
}

/******************************************************************
*函数名称:
*功能描述:
*输入参数:
*输出参数:
*返回值:
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/3/7                              lv we004
******************************************************************/
static void IAP_GPIO_ResetBits(IAP_GPIO_TypeDef* GPIOx, IAP_uint16_t GPIO_Pin)
{
  GPIOx->BRR = GPIO_Pin;
}

/******************************************************************
*函数名称:IAPFeedTheWatchDog
*功能描述:升级程序喂狗
*输入参数:
*输出参数:
*返回值:
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/3/7                              lv we004
******************************************************************/
static void IAPFeedTheWatchDog(void)
{
 //   static IAP_uint32_t ucIAPWatchdogCount = 0;
    
    if (0 == ucIAPWatchdogCount)
    {
        IAP_GPIO_ResetBits(IAP_WATCH_DOG_GPIO, IAP_WATCH_DOG_PIN);
        ucIAPWatchdogCount = 1;
    }
    else
    {
        IAP_GPIO_SetBits(IAP_WATCH_DOG_GPIO, IAP_WATCH_DOG_PIN);
        ucIAPWatchdogCount = 0;
    }
}

/******************************************************************
*函数名称:STM32F0IAPReceive
*功能描述:接收函数，接收更新包
*输入参数:
*输出参数:
*返回值: 
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/12/04                            yangwenfan we014
******************************************************************/
static void STM32F0IAPReceive(IAP_uint32_t uiReceiveLength)
{
    IAP_uint16_t usPacketlength = 0;

    IAP_DMA1_Channel5->CCR &= (IAP_uint16_t)(~IAP_DMA_CCR_EN);    
    IAP_DMA1_Channel5->CNDTR = uiReceiveLength;
    IAP_DMA1_Channel5->CMAR = (IAP_uint32_t)gucIAPUpgradeRebuffer;
    IAP_DMA1_Channel5->CCR |= IAP_DMA_CCR_EN;
    do
    {
        usPacketlength = ((IAP_uint16_t)(IAP_DMA1_Channel5->CNDTR));
    }while(RECEIVE_COMPLETE != usPacketlength);
}

/******************************************************************
*函数名称:STM32F0IAPSend
*功能描述:发送数据
*输入参数:pucSendBuffer                发送buffer
                            usSendLength                发送长度
*输出参数:
*返回值:无
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/1/14                              zhanghaifeng  we015
******************************************************************/
static void STM32F0IAPSend(IAP_uint8_t *pucSendBuffer, IAP_uint16_t usSendLength)
{
    IAP_uint8_t i = 0;

    /*多发送一个字节:主站站号0XFE*/
    usSendLength++;
    
    /*发送DMA使能，发送使用通道2*/
    IAP_DMA1_Channel4->CCR &= (IAP_uint16_t)(~IAP_DMA_CCR_EN);

    /*设置发送数据长度*/
    IAP_DMA1_Channel4->CNDTR = (usSendLength & 0xFFFF);

    /*重新发送buffer*/
    IAP_DMA1_Channel4->CMAR = (IAP_uint32_t)gusIAPUpgradeTxbuffer;
    
    /*拷贝待发送数据到DMA缓存*/
    for (i = 0; i <= usSendLength; i++)
    {
        gucIAPUpgradeTxbuffer[i] = *pucSendBuffer++;
    }

     /*9位模式下发送数据为2字节发送*/
    gusIAPUpgradeTxbuffer[0] = 0XFE|0x100;
    for (i = 0; i < usSendLength; i++)
    {
        gusIAPUpgradeTxbuffer[i+1] = gucIAPUpgradeTxbuffer[i];
    }
   // memcpy(gucIAPUpgradeTxbuffer, pucSendBuffer, usSendLength);
   /*备注:使用MEMCPY会使出现程序不知跑到哪儿的错误，
         以前碰到过，问题没有解决，先使用FOR循环使用*/

    /*使能DMA通道*/
    IAP_DMA1_Channel4->CCR |= IAP_DMA_CCR_EN;

}


/******************************************************************
*函数名称:IAP_FLASH_Unlock
*功能描述:解锁flash空间
*输入参数:
*输出参数:
*返回值: 
*其它说明:库函数FLASH_Unlock
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/12/04                            yangwenfan we014
******************************************************************/
static void IAP_FLASH_Unlock(void)
{
    if((IAP_FLASH->CR & IAP_FLASH_CR_LOCK) != 0)
    {
        /* Unlocking the program memory access */
        IAP_FLASH->KEYR = IAP_FLASH_FKEY1;
        IAP_FLASH->KEYR = IAP_FLASH_FKEY2;
    }
}
/******************************************************************
*函数名称:IAP_FLASH_GetStatus
*功能描述:获取flash操作状态
*输入参数:
*输出参数:
*返回值: 
*其它说明:库函数FLASH_GetStatus
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/12/04                            yangwenfan we014
******************************************************************/
static IAP_FLASH_Status IAP_FLASH_GetStatus(void)
{
    IAP_FLASH_Status FLASHstatus = IAP_FLASH_COMPLETE;

    if((IAP_FLASH->SR & IAP_FLASH_FLAG_BSY) == IAP_FLASH_FLAG_BSY) 
    {
        FLASHstatus = IAP_FLASH_BUSY;
    }
    else 
    {  
        if((IAP_FLASH->SR & (IAP_uint32_t)IAP_FLASH_FLAG_WRPERR)!= (IAP_uint32_t)0x00)
        { 
            FLASHstatus = IAP_FLASH_ERROR_WRP;
        }
        else 
        {
            if((IAP_FLASH->SR & (IAP_uint32_t)(IAP_FLASH_FLAG_PGERR)) != (IAP_uint32_t)0x00)
            {
                FLASHstatus = IAP_FLASH_ERROR_PROGRAM; 
            }
            else
            {
                FLASHstatus = IAP_FLASH_COMPLETE;
            }
        }
    }
    /* Return the FLASH Status */
    return FLASHstatus;
}

/******************************************************************
*函数名称:IAP_FLASH_WaitForLastOperation
*功能描述:上一次flash操作返回值
*输入参数:Timeout
*输出参数:
*返回值: 
*其它说明:库函数FLASH_WaitForLastOperation
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/12/04                            yangwenfan we014
******************************************************************/
static IAP_FLASH_Status IAP_FLASH_WaitForLastOperation(IAP_uint32_t Timeout)
{ 
    IAP_FLASH_Status status = IAP_FLASH_COMPLETE;

    /* Check for the FLASH Status */
    status = IAP_FLASH_GetStatus();

    /* Wait for a FLASH operation to complete or a TIMEOUT to occur */
    while((status == IAP_FLASH_BUSY) && (Timeout != 0x00))
    {
        status = IAP_FLASH_GetStatus();
        Timeout--;
    }

