JacksonOvO/Software_VX_4208/Drivers/src/STM32F0IAPDriver.c
    if(Timeout == 0x00 )
    {
        status = IAP_FLASH_TIMEOUT;
    }
    /* Return the operation status */
    return status;
}

/******************************************************************
*函数名称:IAP_FLASH_ErasePage
*功能描述:擦除扇区某一页
*输入参数:Page_Address
*输出参数:
*返回值: 
*其它说明:库函数FLASH_ErasePage
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/12/04                            yangwenfan we014
******************************************************************/
static IAP_FLASH_Status IAP_FLASH_ErasePage(IAP_uint32_t Page_Address)
{
    IAP_FLASH_Status status = IAP_FLASH_COMPLETE;

    /* Wait for last operation to be completed */
    status = IAP_FLASH_WaitForLastOperation(IAP_FLASH_ER_PRG_TIMEOUT);

    if (IAP_FLASH_COMPLETE == status)
    { 
        /* If the previous operation is completed, proceed to erase the page */
        IAP_FLASH->CR |= IAP_FLASH_CR_PER;
        IAP_FLASH->AR  = Page_Address;
        IAP_FLASH->CR |= IAP_FLASH_CR_STRT;

        /* Wait for last operation to be completed */
        status = IAP_FLASH_WaitForLastOperation(IAP_FLASH_ER_PRG_TIMEOUT);

        /* Disable the PER Bit */
        IAP_FLASH->CR &= ~IAP_FLASH_CR_PER;
    }

    /* Return the Erase Status */
    return status;
}
/******************************************************************
*函数名称:IAP_FLASH_ProgramWord
*功能描述:flash编程
*输入参数:Address
                         Data
*输出参数:
*返回值: 
*其它说明:库函数FLASH_ProgramWord
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/12/04                            yangwenfan we014
******************************************************************/
static IAP_FLASH_Status IAP_FLASH_ProgramWord(IAP_uint32_t Address, IAP_uint32_t Data)
{
    IAP_FLASH_Status status = IAP_FLASH_COMPLETE;
    __IAP_IO IAP_uint32_t tmp = 0;

    /* Wait for last operation to be completed */
    status = IAP_FLASH_WaitForLastOperation(IAP_FLASH_ER_PRG_TIMEOUT);

    if(status == IAP_FLASH_COMPLETE)
    {
        /* If the previous operation is completed, proceed to program the new first 
                     half word */
        IAP_FLASH->CR |= IAP_FLASH_CR_PG;

        *(__IAP_IO IAP_uint16_t*)Address = (IAP_uint16_t)Data;

        /* Wait for last operation to be completed */
        status = IAP_FLASH_WaitForLastOperation(IAP_FLASH_ER_PRG_TIMEOUT);

        if(status == IAP_FLASH_COMPLETE)
        {
            /* If the previous operation is completed, proceed to program the new second 
                             half word */
            tmp = Address + 2;

            *(__IAP_IO IAP_uint16_t*) tmp = Data >> 16;

            /* Wait for last operation to be completed */
            status = IAP_FLASH_WaitForLastOperation(IAP_FLASH_ER_PRG_TIMEOUT);

            /* Disable the PG Bit */
            IAP_FLASH->CR &= ~IAP_FLASH_CR_PG;
        }
        else
        {
            /* Disable the PG Bit */
            IAP_FLASH->CR &= ~IAP_FLASH_CR_PG;
        }
    }

    /* Return the Program Status */
    return status;
}
/******************************************************************
*函数名称:
*功能描述:
*输入参数:
*输出参数:
*返回值:
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/1/18                              zhanghaifeng  we015
******************************************************************/
static void STM32F0IAPMemset(IAP_uint8_t ucBuffer[RECEIVE_SIZE], IAP_uint16_t uiLength)
{
    IAP_uint16_t i = 0;
        
    for(i = 0; i < uiLength; i++)
    {
        ucBuffer[i] = 0;
    }
}

/******************************************************************
*函数名称:STM32F0IAPMemcpy
*功能描述:pucDst         目标地址
                            pucSrc         源地址
                            uiLength      长度
*输入参数:
*输出参数:
*返回值:无
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/1/18                              zhanghaifeng  we015
******************************************************************/
static void STM32F0IAPMemcpy(IAP_uint8_t *pucDst, IAP_uint8_t *pucSrc, IAP_uint32_t uiLength)
{
    IAP_uint32_t i = 0;
    
    for(i = 0; i < uiLength; i++)
    {
       *pucDst++ = *pucSrc++;
    }
}
/******************************************************************
*函数名称:STM32FOIAPTypeIndicate
*功能描述:升级类型
*输入参数:无
*输出参数:
*返回值:无
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/1/15                              zhanghaifeng  we015
******************************************************************/
static void STM32FOIAPTypeIndicate(IAP_uint8_t ucFrameType, IAP_uint8_t ucSlaveStationNumber)
{
    IAP_uint8_t *pucReceiveBuff = IAP_NULL;   /*指向接收消息内容的首地址*/
    IAP_uint32_t uiFromGWProductBatch = 0; /*生产批次*/
    IAP_uint32_t uiProductBatch = 0; /*生产批次*/
    IAP_uint16_t usProductBatch1 = 0; /*生产批次高两个字节*/
    IAP_uint16_t usProductBatch2 = 0; /*生产批次低两个字节*/
    IAP_uint8_t ucHandleRsults = 0; /*处理结果*/
    IAP_uint8_t ucUpgradeType = 0;/*升级类型*/
    IAP_uint32_t uiFlashDestination = 0;/*待拷贝FLASH地址*/
    IAP_uint32_t uiHardWareVersionNUM = 0;/*获取从站硬件版本号*/
    IAP_uint16_t usHardWareVersionNUM1 = 0;/*获取从站硬件版本号1*/
    IAP_uint16_t usHardWareVersionNUM2 = 0;/*获取从站硬件版本号2*/
    IAP_uint32_t uiFromHardWareVersionNUM = 0;/*从网关获取从站硬件版本号*/
    IAP_uint8_t uiFromGWUpgradePackageType = 0; /*从网关获取升级包类型*/
    IAP_uint8_t ucFromGWHardWareVersionAnzahl = 0;/*从网关获取的升级包支持硬件版本个数*/
    IAP_uint8_t i = 0;
    IAP_uint8_t z = 0;
    IAP_FLASH_Status RAMToFlashstatus = IAP_FLASH_TIMEOUT;
    IAP_uint32_t uiProductInfoAddr = IAP_FLASH_DEVICE_INFO_START_ADDR;        /* 产品信息地址 */
    IAP_uint32_t uiUpgradeInfoAddr = IAP_FLASH_UPGRADE_INFO_START_ADDR;         /* 升级信息地址 */
    IAP_uint8_t ucBoardType = 0;        /* 板类型 */
        
    /*解析网关请求帧*/
    pucReceiveBuff = gucIAPUpgradeRebuffer;
    /*从网关获取从站生产批次*/
    STM32F0IAPMemcpy((IAP_uint8_t *)&uiFromGWProductBatch, (IAP_uint8_t *)&gucIAPUpgradeRebuffer[IAP_PRODUCT_BATCH_LOCATION], IAP_PRODUCT_BATCH_SIZE);
    /*获取升级类型*/
    pucReceiveBuff = pucReceiveBuff + IAP_UPGRADE_TYPE_LOCATE;
    STM32F0IAPMemcpy((IAP_uint8_t *)&ucUpgradeType, (IAP_uint8_t *)pucReceiveBuff, IAP_UPGRADE_TYPE_SIZE);
    

    /*获取从站硬件版本号1*/
  //  STM32F0IAPMemcpy((IAP_uint8_t *)&usHardWareVersionNUM1, (IAP_uint8_t *)&gusaDiagnoseData[IAP_HARDWARE_VERSION1_LOCATION], IAP_HARDWARE_VERSION_NUM1_SIZE);
    uiProductInfoAddr += IAP_PRODUCT_INFO_HEAD_LENGTH + IAP_PRODUCT_INFO_CONTENT_HEAD_LENGTH;
    STM32F0IAPMemcpy((IAP_uint8_t *)&usHardWareVersionNUM1, (IAP_uint8_t *)uiProductInfoAddr, IAP_PRODUCT_INFO_CONTENT_LENGTH);
    /*获取从站硬件版本号2*/
   // STM32F0IAPMemcpy((IAP_uint8_t *)&usHardWareVersionNUM2, (IAP_uint8_t *)&gusaDiagnoseData[IAP_HARDWARE_VERSION2_LOCATION], IAP_HARDWARE_VERSION_NUM2_SIZE);
    uiProductInfoAddr += IAP_PRODUCT_INFO_CONTENT_LENGTH + IAP_PRODUCT_INFO_CONTENT_HEAD_LENGTH;
    STM32F0IAPMemcpy((IAP_uint8_t *)&usHardWareVersionNUM2, (IAP_uint8_t *)uiProductInfoAddr, IAP_PRODUCT_INFO_CONTENT_LENGTH);
    /*组装从站硬件版本号*/
    uiHardWareVersionNUM = ( (usHardWareVersionNUM1 << BIT_16) | usHardWareVersionNUM2 );

    /*获取从站产品批次1*/
    //STM32F0IAPMemcpy((IAP_uint8_t *)&usProductBatch1, (IAP_uint8_t *)&gusaDiagnoseData[IAP_PRODUCT_BATCH1_LOCATION], IAP_PRODUCT_BATCH1_SIZE);
    uiProductInfoAddr += IAP_PRODUCT_INFO_CONTENT_LENGTH + IAP_PRODUCT_INFO_CONTENT_HEAD_LENGTH;
    STM32F0IAPMemcpy((IAP_uint8_t *)&usProductBatch1, (IAP_uint8_t *)uiProductInfoAddr, IAP_PRODUCT_INFO_CONTENT_LENGTH);
    /*获取从站产品批次2*/
 //   STM32F0IAPMemcpy((IAP_uint8_t *)&usProductBatch2, (IAP_uint8_t *)&gusaDiagnoseData[IAP_PRODUCT_BATCH2_LOCATION], IAP_PRODUCT_BATCH2_SIZE);
    uiProductInfoAddr += IAP_PRODUCT_INFO_CONTENT_LENGTH + IAP_PRODUCT_INFO_CONTENT_HEAD_LENGTH;
    STM32F0IAPMemcpy((IAP_uint8_t *)&usProductBatch2, (IAP_uint8_t *)uiProductInfoAddr, IAP_PRODUCT_INFO_CONTENT_LENGTH);
    /*组装从站产品批次*/
    uiProductBatch = ( (usProductBatch1 << BIT_16) | usProductBatch2 );
    /*判断从站产品批次是否合法*/
    if (uiProductBatch != uiFromGWProductBatch)
    {
        ucHandleRsults = IAP_PRODUCT_BATCHES_ERROR;
        
        /*响应产品批次错误帧*/
        (void)STM32F0TypeIndicateResponse(ucSlaveStationNumber, ucFrameType, ucUpgradeType, ucHandleRsults);
        return;
    }

