JacksonOvO/Software_VX_4208/Drivers/src/STM32F0IAPDriver.c
    /*从网关获取升级包类型*/
    pucReceiveBuff = pucReceiveBuff + IAP_UPGRADE_PACKAGE_TYPE_LOCATE;
    STM32F0IAPMemcpy((IAP_uint8_t *)&uiFromGWUpgradePackageType, (IAP_uint8_t *)pucReceiveBuff, IAP_UPGRADE_PACKAGE_TYPE_SIZE);
    
    /*判断升级包类型是否合法*/
    //if(uiFromGWUpgradePackageType != gucaIOUpgradeInfo[IAP_SLAVE_UPGRADE_PACKAGE_TYPE_LOCATE])
    STM32F0IAPMemcpy(&ucBoardType, (IAP_uint8_t *)uiUpgradeInfoAddr, IAP_UPGRADE_BOARD_TYPE_LENGTH);
    if(uiFromGWUpgradePackageType != ucBoardType)
    {
        ucHandleRsults = IAP_UPGRADE_PACKAGE_TYPE_ERROR;
        STM32F0TypeIndicateResponse(ucSlaveStationNumber, ucFrameType, ucUpgradeType, ucHandleRsults);
        return;
    }

    /*从网关获取升级包支持的硬件版本个数*/
    pucReceiveBuff = pucReceiveBuff + IAP_HARDWARE_VERSION_ANZAHL_LOCATE;
    STM32F0IAPMemcpy((IAP_uint8_t *)&ucFromGWHardWareVersionAnzahl, (IAP_uint8_t *)pucReceiveBuff, IAP_HARDWARE_VERSION_ANZAHL_SIZE);

    /*检测硬件版本号是否合法*/
    /*指向硬件版本号*/
    pucReceiveBuff = pucReceiveBuff + IAP_HARDWARE_VERSION_ANZAHL_SIZE;
    for(i = 0; i < ucFromGWHardWareVersionAnzahl; i++)
    {
        STM32F0IAPMemcpy((IAP_uint8_t *)&uiFromHardWareVersionNUM, (IAP_uint8_t *)pucReceiveBuff, IAP_HARDWARE_VERSION_NUM_SIZE);
        if(uiFromHardWareVersionNUM == uiHardWareVersionNUM)
        {
            break;
        }
        pucReceiveBuff = pucReceiveBuff + IAP_HARDWARE_VERSION_NUM_SIZE;
    }
    if(i == ucFromGWHardWareVersionAnzahl)
    {
        ucHandleRsults = IAP_HARDWARE_VERSION_NUM_ERROR;
        STM32F0TypeIndicateResponse(ucSlaveStationNumber, ucFrameType, ucUpgradeType, ucHandleRsults);
        return;
    }
    
    /*升级类型*/
    switch(ucUpgradeType)
    {
    case IAP_PROGRAM_UPGRADE :
    {
        uiFlashDestination = IAP_UPGRADE_CODE;
        
        /*擦除代码扇区*/
        for(i = 0;i < IAP_CODE_SECTOR_NUM;i++)
        {
            for(z = 0; z < IAP_SECTOR_ERASE_TIMES; z++)
            {
                /* BEGIN: Added by lv we004, 2017/3/8   PN:watchdog */
                IAPFeedTheWatchDog();
                /* END:   Added by lv we004, 2017/3/8 */
                RAMToFlashstatus = IAP_FLASH_ErasePage(uiFlashDestination + (PAGE_SIZE * z));
                if(RAMToFlashstatus != IAP_FLASH_COMPLETE)
                {
                    ucHandleRsults = IAP_FLASH_ERASER_ERROR;
                    STM32F0TypeIndicateResponse(ucSlaveStationNumber, ucFrameType, ucUpgradeType, ucHandleRsults);                
                } 
            }           
            uiFlashDestination += (PAGE_SIZE * z);
        }
        break;
    }
    case IAP_DEVICE_FILE :
    {
        uiFlashDestination = IAP_UPGRADE_DEVICE;

        /*擦除设备描述文件扇区*/
        for(z = 0; z < IAP_SECTOR_ERASE_TIMES; z++)
        {
            /* BEGIN: Added by lv we004, 2017/3/8   PN:watchdog */
            IAPFeedTheWatchDog();
            /* END:   Added by lv we004, 2017/3/8 */
            
            RAMToFlashstatus = IAP_FLASH_ErasePage(uiFlashDestination + (PAGE_SIZE * z));
            if(RAMToFlashstatus != IAP_FLASH_COMPLETE)
            {
                ucHandleRsults = IAP_FLASH_ERASER_ERROR;
                STM32F0TypeIndicateResponse(ucSlaveStationNumber, ucFrameType, ucUpgradeType, ucHandleRsults);                
            }  
        }
        break;
    }
    case IAP_VERSION_DATA :
    {
        uiFlashDestination = IAP_UPGRADE_VERSION;

        /*擦除杂项数据扇区*/
        for(z = 0; z < IAP_SECTOR_ERASE_TIMES; z++)
        {
            /* BEGIN: Added by lv we004, 2017/3/8   PN:watchdog */
            IAPFeedTheWatchDog();
            /* END:   Added by lv we004, 2017/3/8 */
            
            RAMToFlashstatus = IAP_FLASH_ErasePage(uiFlashDestination + (PAGE_SIZE * z));
            if(RAMToFlashstatus != IAP_FLASH_COMPLETE)
            {            
                ucHandleRsults = IAP_FLASH_ERASER_ERROR;
                STM32F0TypeIndicateResponse(ucSlaveStationNumber, ucFrameType, ucUpgradeType, ucHandleRsults);                
            }   
        }

        break;
    }
    default :
    {
        ucHandleRsults = IAP_UPGRADE_TYPE_ERROR;
        
        /*响应升级类型错误帧*/
        (void)STM32F0TypeIndicateResponse(ucSlaveStationNumber, ucFrameType, ucUpgradeType, ucHandleRsults);
        return;
    }
    }
    
    /*组装并相应成功*/
    ucHandleRsults = SYSTEM_UPGRADE_REQ_HANDLE_SUCCESS;
    
    /*响应成功帧*/
    (void)STM32F0TypeIndicateResponse(ucSlaveStationNumber, ucFrameType, ucUpgradeType, ucHandleRsults);

    return;
}

/******************************************************************
*函数名称:STM32F0TypeIndicateResponse
*功能描述:升级类型响应
*输入参数:
                            ucSlaveStationNum      从站站号
                            ucFrameType               帧类型
                            ucUpgradeType            升级类型
                            ucHandleResult             处理结果
*输出参数:
*返回值:无
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/1/15                              zhanghaifeng  we015
******************************************************************/
static void STM32F0TypeIndicateResponse(IAP_uint8_t ucSlaveStationNum, 
                    IAP_uint8_t ucFrameType, IAP_uint8_t ucUpgradeType, IAP_uint8_t ucHandleResult)
{    
    IAP_uint16_t usIapSendCrc16Value = 0;
    
    /*组装升级类型错误响应帧*/
    /*备注:使用MEMCPY，MEMSET会使出现程序不知跑到哪儿的错误，
          以前碰到过，问题没有解决，先使用注释掉*/
    STM32F0IAPMemset(gucIAPUpgradeTxbuffer, RECEIVE_SIZE);
    gucIAPUpgradeTxbuffer[GW_STATION_LOCATION] = GW_STATION_NUM;
    gucIAPUpgradeTxbuffer[SLAVE_STATION_LOCATION] = ucSlaveStationNum;
    gucIAPUpgradeTxbuffer[FRAME_TYPE_LOCATION] = ucFrameType;
    gucIAPUpgradeTxbuffer[UPGRADE_TYPE_LOCATION] = ucUpgradeType;
    gucIAPUpgradeTxbuffer[IAP_TYPE__HANDLE_RESULT_LOCATION] = ucHandleResult;
    
    
    /*计算CRC16校验值*/
    usIapSendCrc16Value = usIapMBSCRC16(( const IAPUBYTE * )&gucIAPUpgradeTxbuffer[0], IAP_TYPE_RESPONSE_FRAME_LEN);
    
    /*CRC校验值添加到发送数据后面两位*/   
    STM32F0IAPMemcpy((IAP_uint8_t *)&gucIAPUpgradeTxbuffer[IAP_TYPE_RESPONSE_FRAME_LEN], (IAP_uint8_t *)&usIapSendCrc16Value, IAP_CRC16_VALUE_LENGTH);

