JacksonOvO/Software_VX_4208/Drivers/src/STM32F0IAPDriver.c
    /*发送响应*/    
    /*回复网关响应帧*/
    (void)STM32F0IAPSend(gucIAPUpgradeTxbuffer, IAP_TYPE_RESPONSE_FRAME_LEN + IAP_CRC16_VALUE_LENGTH);   
}
/******************************************************************
*函数名称:STM32FOIAPContent
*功能描述:升级内容
*输入参数:无
*输出参数:
*返回值:无
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/1/15                              zhanghaifeng  we015
******************************************************************/
static void STM32FOIAPContent(void)
{
    IAP_uint8_t *pucReceiveBuff = IAP_NULL;   /*指向接收消息内容的首地址*/
    IAP_uint8_t ucUpgradeType = 0;
    IAP_uint16_t usUpgradePackagelen = 0;/*升级包长度*/
    IAP_uint8_t ucHandleResult = 0; /*处理结果*/
    IAP_uint32_t uiUpgradePackageSN = 0;/*升级包序号*/
    IAP_uint32_t uiFlashDestination = 0;/*待拷贝FLASH地址*/
    IAP_uint8_t ucPacketretransmission = 0;/*包重传标志*/
    /*定义静态变量，由于判断，包序号是否连续*/
    //static IAP_uint32_t uiNextCodePackageSN = 0;
    //static IAP_uint32_t uiNextDeviceInfoPackageSN = 0;                                                                                                                                                                                                                                                                                                          
    //static IAP_uint32_t uiNextVersionPackageSN = 0;
    IAP_Result_e eResult = E_IAP_BUTT;
    
    /*解析网关请求帧，获取升级类型，升级包序号*/
    pucReceiveBuff = gucIAPUpgradeRebuffer;
    /*获取升级类型*/
    pucReceiveBuff = pucReceiveBuff + IAP_UPGRADE_TYPE_LOCATION;
    STM32F0IAPMemcpy((IAP_uint8_t *)&ucUpgradeType, (IAP_uint8_t *)pucReceiveBuff, IAP_UPGRADE_TYPE_SIZE);
    /*获取包重传标志*/
    pucReceiveBuff = pucReceiveBuff + IAP_UPGRADE_TYPE_SIZE;
    STM32F0IAPMemcpy((IAP_uint8_t *)&ucPacketretransmission, (IAP_uint8_t *)pucReceiveBuff, IAP_PACKAGE_RETRANSMISSION_SIZE);
    /*获取升级包顺序号*/
    pucReceiveBuff = pucReceiveBuff + IAP_PACKAGE_RETRANSMISSION_SIZE;
    STM32F0IAPMemcpy((IAP_uint8_t *)&uiUpgradePackageSN, (IAP_uint8_t *)pucReceiveBuff, IAP_UPGRADE_PACKAGE_SN_SIZE);
    /*获取升级包内容长度*/
    pucReceiveBuff = pucReceiveBuff + IAP_UPGRADE_PACKAGE_SN_SIZE;
    STM32F0IAPMemcpy((IAP_uint8_t *)&usUpgradePackagelen, (IAP_uint8_t *)pucReceiveBuff, IAP_UPGRADE_PACKAGE_SIZE);

    switch(ucUpgradeType)
    {
    case IAP_PROGRAM_UPGRADE :
    {
        uiFlashDestination = IAP_UPGRADE_CODE;  
        
        /*拷贝RAM数据到响应的FLASH中*/      
        eResult = STM32F0IAPRAMToFlash(gucIAPUpgradeRebuffer,ucPacketretransmission,uiUpgradePackageSN,
                     usUpgradePackagelen, uiNextCodePackageSN,
                     uiFlashDestination + (uiNextCodePackageSN * IAP_FLASH_SECTOR_SIZE));
        if(eResult != E_IAP_OK)
        {
            return;

        }
        /*下一个连续的序列号*/
        uiNextCodePackageSN = uiUpgradePackageSN + IAP_TO_NEXT_SN;
        break;
    }
    case IAP_DEVICE_FILE :
    {
        uiFlashDestination = IAP_UPGRADE_DEVICE;
        
        /*拷贝RAM数据到响应的FLASH中*/
        eResult = STM32F0IAPRAMToFlash(gucIAPUpgradeRebuffer,ucPacketretransmission,uiUpgradePackageSN,
                    usUpgradePackagelen,uiNextDeviceInfoPackageSN,
                    uiFlashDestination + (uiNextDeviceInfoPackageSN * IAP_FLASH_SECTOR_SIZE));
        if(eResult != E_IAP_OK)
        {
            return;

        }
        /*下一个连续的序列号*/
        uiNextDeviceInfoPackageSN = uiUpgradePackageSN + IAP_TO_NEXT_SN;
        break;
    }
    case IAP_VERSION_DATA :
    {
        uiFlashDestination = IAP_UPGRADE_VERSION;
        
        /*拷贝RAM数据到响应的FLASH中*/
        eResult = STM32F0IAPRAMToFlash(gucIAPUpgradeRebuffer,ucPacketretransmission,uiUpgradePackageSN,
                    usUpgradePackagelen,uiNextVersionPackageSN,
                    uiFlashDestination + (uiNextVersionPackageSN * IAP_FLASH_SECTOR_SIZE));
        if(eResult != E_IAP_OK)
        {
            return;
        }
        /*下一个连续的序列号*/
        uiNextVersionPackageSN = uiUpgradePackageSN + IAP_TO_NEXT_SN;
        break;
    }
    default :
    {
        ucHandleResult = IAP_UPGRADE_TYPE_ERROR;
        
        /*响应升级类型错误帧*/
        STM32F0ContentIndicateResponse(gucIAPUpgradeRebuffer,ucHandleResult);
        return;
    }
    }
    /*组装并相应成功*/
    ucHandleResult = SYSTEM_UPGRADE_REQ_HANDLE_SUCCESS;

    /*响应成功帧*/
    STM32F0ContentIndicateResponse(gucIAPUpgradeRebuffer, ucHandleResult);
    
    return;
}
/******************************************************************
*函数名称:STM32F0ContentIndicateResponse
*功能描述:升级内容响应
*输入参数:
                            pucReceiveBuff             接收BUFFER
                            ucSlaveStationNum      从站站号
                            ucFrameType               帧类型
                            ucUpgradeType            升级类型
                            ucHandleResult             处理结果
*输出参数:
*返回值:无
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/1/15                              zhanghaifeng  we015
******************************************************************/
static void STM32F0ContentIndicateResponse(IAP_uint8_t *pucReceiveBuff, IAP_uint8_t ucHandleResult)
{
    IAP_uint8_t *pucFrameBufferstatus = IAP_NULL;
    IAP_uint16_t usIapSendCrc16Value = 0;
    /*组装从站升级内容相应帧*/
    pucFrameBufferstatus = gucIAPUpgradeTxbuffer;
    STM32F0IAPMemset(gucIAPUpgradeTxbuffer, RECEIVE_SIZE);

    /*网关站号组装*/
    *pucFrameBufferstatus++ = GW_STATION_NUM; 

    /*从站站号，帧类型，升级类型，包顺序号。处理结果组装*/
    STM32F0IAPMemcpy(pucFrameBufferstatus, pucReceiveBuff, IAP_CONTENT_RESPONSE_SIZE);
    pucFrameBufferstatus = pucFrameBufferstatus + IAP_CONTENT_RESPONSE_SIZE;
    *pucFrameBufferstatus = ucHandleResult;
 
    /*计算CRC16校验值*/
    usIapSendCrc16Value = usIapMBSCRC16(( const IAPUBYTE * )&gucIAPUpgradeTxbuffer[0], IAP_UPGRADE_CONTENT_REQ_FRAME_SIZE);
    
    /*CRC校验值添加到发送数据后面两位*/   
    STM32F0IAPMemcpy((IAP_uint8_t *)&gucIAPUpgradeTxbuffer[IAP_UPGRADE_CONTENT_REQ_FRAME_SIZE], (IAP_uint8_t *)&usIapSendCrc16Value, IAP_CRC16_VALUE_LENGTH);

    /*回复响应帧给网关*/
    STM32F0IAPSend(gucIAPUpgradeTxbuffer, IAP_UPGRADE_CONTENT_REQ_FRAME_SIZE + IAP_CRC16_VALUE_LENGTH); 
}

/******************************************************************
*函数名称:STM32F0IAPRAMToFlash
*功能描述:拷贝数据从RAM至FLASH
*输入参数:      
                            pucReceiveBuff             接收BUFFER
                            uiUpgradePackageSN    升级包顺序号
                            usUpgradePackagelen   升级包内容长度
                            uiNextPackageSN          下个升级包顺序号
                            uiFlashDestination         FLASH拷贝起始地址
*输出参数:
*返回值:    E_IAP_CONTENT__FRAME_CHECK_ERROR     帧检查错误
                          E_IAP_RAM_TO_FLASH_ERROR,         从RAM向FLASH拷贝错误

