JacksonOvO/Software_VX_4208/Drivers/src/STM32F0IAPDriver.c
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/1/15                              zhanghaifeng  we015
******************************************************************/
static IAP_Result_e STM32F0IAPRAMToFlash(IAP_uint8_t *pucReceiveBuff, IAP_uint8_t ucPacketretransmission, 
            IAP_uint32_t uiUpgradePackageSN, IAP_uint16_t usUpgradePackagelen, IAP_uint32_t uiNextPackageSN, IAP_uint32_t uiFlashDestination)
{
    IAP_uint8_t i = 0;
    IAP_uint32_t RamSource = 0;
    IAP_uint8_t ucHandleResult = 0; 
    IAP_Result_e eResult = E_IAP_BUTT;
    IAP_FLASH_Status eFlashResult =  IAP_FLASH_TIMEOUT;
    IAP_uint8_t *pucUpgradeOffset = IAP_NULL;

    /*升级包顺序号，长度，序列号检查*/
    eResult = STM32IAPContentFrameCheck(pucReceiveBuff, uiUpgradePackageSN, ucPacketretransmission, usUpgradePackagelen, uiNextPackageSN);
    if (E_IAP_OK != eResult)
    {
        return E_IAP_CONTENT__FRAME_CHECK_ERROR;
    }
    pucUpgradeOffset = &gucIAPUpgradeRebuffer[IAP_UPGRADE_PACKAGE_CONTENT_LOCATION];

    /*单个包复制循环*/
    for(i = 0;i < PAGE_PROGRAMME_TIME;i++)
    {
        STM32F0IAPMemcpy((IAP_uint8_t *)&RamSource, pucUpgradeOffset, PROGRAMME_LENGTH);
        eFlashResult = IAP_FLASH_ProgramWord(uiFlashDestination,RamSource);
        if (eFlashResult != IAP_FLASH_COMPLETE)
        {
            ucHandleResult = IAP_FLASH_WRITE_ERROR;
            
            /*响应未知错误*/
            STM32F0ContentIndicateResponse(pucReceiveBuff, ucHandleResult);
            return E_IAP_RAM_TO_FLASH_ERROR;
        }
        uiFlashDestination += PROGRAMME_LENGTH;
        pucUpgradeOffset = pucUpgradeOffset + PROGRAMME_LENGTH;
    }        
    return E_IAP_OK;
}

/******************************************************************
*函数名称:STM32IAPContentFrameCheck
*功能描述:
*输入参数:
                        pucReceiveBuff             接收BUFFER
                        uiUpgradePackageSN    升级包顺序号
                        usUpgradePackagelen   升级包内容长度
                        uiNextPackageSN          下个升级包顺序号
*输出参数:
*返回值:    E_IAP_CONTENT__FRAME_CHECK_UPGRADE_PACKAGE_SN_ERROR,   升级内容,升级包顺序号错误
                         E_IAP_CONTENT__FRAME_CHECK_UPGRADE_PACKAGE_SIZE_ERROR,                      升级包大小错误
                         E_IAP_CONTENT__FRAME_CHECK_UPGRADE_PACKAGE_NUM_ERROR,                      升级包序列号错误
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/1/18                              zhanghaifeng  we015
******************************************************************/
static IAP_Result_e STM32IAPContentFrameCheck(IAP_uint8_t *pucReceiveBuff, IAP_uint32_t uiUpgradePackageSN, 
                                           IAP_uint8_t ucPacketretransmission, IAP_uint16_t usUpgradePackagelen, IAP_uint32_t uiNextPackageSN)
{
    IAP_uint8_t ucHandleResult = 0; 

    /*判断升级包顺序号是否合法*/
    if (uiUpgradePackageSN >= IAP_MAX_PROGRAM_UPGRADE_PACKAGE_COUNT)
    {
        ucHandleResult = IAP_UPGRADE_PACKAGE_NUM_ERROR;

        /*响应升级包顺序号非法错误帧*/
        STM32F0ContentIndicateResponse(pucReceiveBuff,ucHandleResult);
        return E_IAP_CONTENT__FRAME_CHECK_UPGRADE_PACKAGE_SN_ERROR;
    }

    /*判断升级包长度是否为128*/
    if (IAP_SLAVE_UPGRADE_PACKAGE_SIZE != usUpgradePackagelen)
    {
        ucHandleResult = IAP_UPGRADE_PACKAGE_LEN_ERROR;

        /*响应升级包长度错误帧*/
        STM32F0ContentIndicateResponse(pucReceiveBuff,ucHandleResult);
        return E_IAP_CONTENT__FRAME_CHECK_UPGRADE_PACKAGE_SIZE_ERROR;
    }

    if(ucPacketretransmission == IAP_NOT_PACKAGE_RETRANSMISSION)
    {
        /*判断序列号是否连续*/
        if (uiUpgradePackageSN != 0)
        {
            if (uiUpgradePackageSN != uiNextPackageSN)
            {
                ucHandleResult = IAP_UPGRADE_PACKAGE_NUM_ERROR;

                /*响应包序列号不连续错误帧*/
                STM32F0ContentIndicateResponse(pucReceiveBuff,ucHandleResult);
                return E_IAP_CONTENT__FRAME_CHECK_UPGRADE_PACKAGE_NUM_ERROR;
            }
        }
    }
    if(ucPacketretransmission > IAP_PACKAGE_RETRANSMISSION)
    {
        ucHandleResult = IAP_PACKAGE_RETRANSMISSION_ERROR;
        STM32F0ContentIndicateResponse(gucIAPUpgradeRebuffer, ucHandleResult);
    }
    return E_IAP_OK;
}

/******************************************************************
*函数名称:STM32FOIAPComplete
*功能描述:升级完成
*输入参数:无
*输出参数:
*返回值:无
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/1/15                              zhanghaifeng  we015
******************************************************************/
static void STM32FOIAPComplete(IAP_uint8_t ucFrameType, IAP_uint8_t ucSlaveStationNumber)
{
    IAP_uint8_t *pucReceiveBuff = IAP_NULL;   /*指向接收消息内容的首地址*/
    IAP_uint32_t uiFromGWProductBatch = 0;
    IAP_uint32_t uiFromGWProductSerialNum = 0;
    IAP_uint8_t ucHandleRsults = 0; /*处理结果*/
    IAP_uint32_t uiProductBatch = 0; /*生产批次*/
    IAP_uint16_t usProductBatch1 = 0; /*生产批次高两个字节*/
    IAP_uint16_t usProductBatch2 = 0; /*生产批次低两个字节*/
    IAP_uint32_t uiProductInfoAddr = IAP_FLASH_DEVICE_INFO_START_ADDR;        /* 产品信息地址 */
    
    /*解析网关请求帧*/
    pucReceiveBuff = gucIAPUpgradeRebuffer;
    /*从网关获取从站生产批次*/
    pucReceiveBuff = pucReceiveBuff + IAP_PRODUCT_BATCH_LOCATION;
    STM32F0IAPMemcpy((IAP_uint8_t *)&uiFromGWProductBatch, (IAP_uint8_t *)pucReceiveBuff, IAP_PRODUCT_BATCH_SIZE);
    /*从网关获取从站序列号*/
    pucReceiveBuff = pucReceiveBuff + IAP_PRODUCT_BATCH_SIZE;
    STM32F0IAPMemcpy((IAP_uint8_t *)&uiFromGWProductSerialNum, (IAP_uint8_t *)pucReceiveBuff, IAP_PRODUCT_SERIAL_NUM_SIZE);
      
    /*获取从站产品批次1*/
    //STM32F0IAPMemcpy((IAP_uint8_t *)&usProductBatch1, (IAP_uint8_t *)&gusaDiagnoseData[IAP_PRODUCT_BATCH1_LOCATION], IAP_PRODUCT_BATCH1_SIZE);
    uiProductInfoAddr += IAP_PRODUCT_INFO_CONTENT_LENGTH + IAP_PRODUCT_INFO_CONTENT_HEAD_LENGTH + IAP_PRODUCT_BATCH_LOCATION_OFFSET;
    STM32F0IAPMemcpy((IAP_uint8_t *)&usProductBatch1, (IAP_uint8_t *)uiProductInfoAddr, IAP_PRODUCT_INFO_CONTENT_LENGTH);
    /*获取从站产品批次2*/
    //STM32F0IAPMemcpy((IAP_uint8_t *)&usProductBatch2, (IAP_uint8_t *)&gusaDiagnoseData[IAP_PRODUCT_BATCH2_LOCATION], IAP_PRODUCT_BATCH2_SIZE);
    uiProductInfoAddr += IAP_PRODUCT_INFO_CONTENT_LENGTH + IAP_PRODUCT_INFO_CONTENT_HEAD_LENGTH;
    STM32F0IAPMemcpy((IAP_uint8_t *)&usProductBatch2, (IAP_uint8_t *)uiProductInfoAddr, IAP_PRODUCT_INFO_CONTENT_LENGTH);
    /*组装从站产品批次*/
    uiProductBatch = ( (usProductBatch1 << BIT_16) | usProductBatch2 );
    /*判断从站产品批次是否合法*/
    if (uiProductBatch != uiFromGWProductBatch)
    {
        ucHandleRsults = IAP_PRODUCT_BATCHES_ERROR;

        /*  响应从站产品批次非法帧*/
        STM32F0IAPCompleteIndicateResponse(ucSlaveStationNumber, ucFrameType,ucHandleRsults);
        return;
    }
    
    /*从站软复位*/
    /*系统复位*/
    STM32F0Reset();
    
    return;
}
/******************************************************************
*函数名称:STM32F0Reset
*功能描述:软复位
*输入参数:无
*输出参数:
*返回值:无
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/1/19                              zhanghaifeng  we015
******************************************************************/
static void STM32F0Reset(void)
{
    asm ("DSB");
    IAP_SCB->AIRCR = IAP_RESET; 
    asm ("DSB");
    while(1);                                                    /* wait until reset */
}
/******************************************************************
*函数名称:STM32F0IAPCompleteIndicateResponse
*功能描述:升级完成响应
*输入参数:
                            ucSlaveStationNum      从站站号
                            ucFrameType               帧类型
                            ucHandleResult             处理结果
*输出参数:
*返回值:
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/1/15                              zhanghaifeng  we015
******************************************************************/
static void STM32F0IAPCompleteIndicateResponse(IAP_uint8_t ucSlaveStationNum, IAP_uint8_t ucFrameType,IAP_uint8_t ucHandleResult)
{
    IAP_uint16_t usIapSendCrc16Value = 0;
    /*组装升级类型错误响应帧*/
    /*备注:使用MEMCPY，MEMSET会使出现程序不知跑到哪儿的错误，
        以前碰到过，问题没有解决，先使用注释掉*/
    //memset(gucIAPUpgradeTxbuffer,0,sizeof(gucIAPUpgradeTxbuffer));
    STM32F0IAPMemset(gucIAPUpgradeTxbuffer, RECEIVE_SIZE);
    gucIAPUpgradeTxbuffer[GW_STATION_LOCATION] = GW_STATION_NUM;
    gucIAPUpgradeTxbuffer[SLAVE_STATION_LOCATION] = ucSlaveStationNum;
    gucIAPUpgradeTxbuffer[FRAME_TYPE_LOCATION] = ucFrameType;
    gucIAPUpgradeTxbuffer[IAP_COMPLETE_HANDLE_RESULT_LOCATION] = ucHandleResult;
    
    /*计算CRC16校验值*/
    usIapSendCrc16Value = usIapMBSCRC16(( const IAPUBYTE * )&gucIAPUpgradeTxbuffer[0], IAP_COMPLETE_RESPONSE_FRAME_LEN);
    
    /*CRC校验值添加到发送数据后面两位*/   
    STM32F0IAPMemcpy((IAP_uint8_t *)&gucIAPUpgradeTxbuffer[IAP_COMPLETE_RESPONSE_FRAME_LEN], (IAP_uint8_t *)&usIapSendCrc16Value, IAP_CRC16_VALUE_LENGTH);

    /*回复网关响应帧*/
    STM32F0IAPSend(gucIAPUpgradeTxbuffer, IAP_COMPLETE_RESPONSE_FRAME_LEN + IAP_CRC16_VALUE_LENGTH);
}

/******************************************************************
*函数名称:STM32F0IAPUpgrade
*功能描述:升级接口
*输入参数:ucSlaveStationNumber       从站站号
*输出参数:
*返回值:无
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2017/1/15                              zhanghaifeng  we015
******************************************************************/
__root static void STM32F0IAPUpgrade(IAP_uint8_t ucSlaveStationNumber, IAP_uint32_t uiSlavestationBaud) @".STM32F0IAPUpgrade"
{
    /*帧类型*/
    IAP_uint8_t ucFrameType = 0;
    IAP_uint16_t i = 0;
    IAP_uint16_t usIapRecvCrc16Value = 0;
    
