JacksonOvO/Software_VX_4208/Drivers/src/STM32F0IAPDriver.c
    /*关闭所有中断 使用的汇编语言*/
    asm ("CPSID   I");
    
    /*串口使能*/
    IAP_USART1->CR1 |= IAP_USART_CR1_UE;

    /*解锁flash*/
    IAP_FLASH_Unlock();

    while(1)
    {
        /* BEGIN: Added by lv we004, 2017/3/8   PN:watchdog */
        IAPFeedTheWatchDog();
        /* END:   Added by lv we004, 2017/3/8 */

        /*调用接收函数，接收网关请求帧*/
        for(i = 0; i < RECEIVE_SIZE; i++)
        {
            gucIAPUpgradeRebuffer[i] = 0;
        }

        STM32F0IAPReceive(FROM_GW_REQUEST_FRAME_LEN + IAP_CRC16_VALUE_LENGTH );
        usIapRecvCrc16Value = usIapMBSCRC16(( const IAPUBYTE * )&gucIAPUpgradeRebuffer[0], FROM_GW_REQUEST_FRAME_LEN + IAP_CRC16_VALUE_LENGTH);
        if(IAP_CRC16_VALUE_NOERR != usIapRecvCrc16Value)
        {
            continue;
        }

        /*检查从站站号是否合法*/
        if (gucIAPUpgradeRebuffer[FROM_GW_SLAVE_STATION_LOCATION] != ucSlaveStationNumber)
        {
            continue;
        }
        
        /*帧类型解析*/
        ucFrameType = gucIAPUpgradeRebuffer[FROM_GW_FRAME_TYPE_LOCATION];

        /*帧类型*/
        switch(ucFrameType)
        {
        case IAP_TYPE_INDICATE_REQ :
        {
            STM32FOIAPTypeIndicate(ucFrameType, ucSlaveStationNumber);
            break;
        }
        case IAP_CONTENT_REQ :
        {          
            STM32FOIAPContent();
            break;
        }
        case IAP_COMPLETE_REQ :
        {
            STM32FOIAPComplete(ucFrameType, ucSlaveStationNumber);
            break;
        }
        default :
        {
        }
        }
    }
}


